---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RoutingPreferenceRule
source: html/a39b39b1-b747-f673-a5db-cba6f65c9f0f.htm
---
# RoutingPreferenceRule Members

Constructs a RoutingPreferenceRule containing a segment or fitting Id (MEPPartId) and description.